# 집합 기초

# ===========================================================
#  집합 (set): 여러 객체를 순서 없이 중복을 허용하지 않고 저장하는 변경 가능한 자료형
#  집합의 특징
#  1. ( mutable, 변경 가능 ) (= list, dictionary)
#  2. ( iterable, 반복 가능 )
#  3. ( sequence X, 인덱싱과 슬라이싱 불가 )
#  4. ( 중복 허용 안 함 )
# ===========================================================

# (빈) 집합 생성
# a = {} # 딕셔너리
a = set()
print(type(a))

print({3, 3, 3, 2, 2, 1})
print({2147483647, 352, 534734, 31415926535897932384626, 2147483647, 998244353})
print(a)    # hash MOD 값 적용한 오름차순으로 나옴 (= 원본 기준 무조건 오름차순 X, 순서 중요 X)

# ===========================================================
# 1. 집합은 mutable하다. (변경 가능)
# ===========================================================

a = {1, 2, 3}
a.update({3, 4})  # return None : 원본을 바꿈
print(a)    # {1, 2, 3, 4}

a.update([5, 6])
print(a)    # {1, 2, 3, 4, 5, 6}

a.remove(3)
print(a)

# ===========================================================
# 2. 집합은 iterable하다. (반복 가능)
# ===========================================================

# 집합 순회
for i in a:
    print(i)


# ===========================================================
# 3. 집합은 sequence 객체가 아니다. (인덱싱, 슬라이싱 불가)
# ===========================================================

# a[0] = 10   # __setitem__ 없음 -> TypeError (= string, set)


# ===========================================================
# 4. 집합은 중복을 허용하지 않는다.
# ===========================================================

s = {10, 10, 20, 20, 30}
print(s)

# ===========================================================
#  파이썬 내장 함수
# ===========================================================

print(len(s))   # 3
print(sum(s))   # 60
print(min(s))   # 10
print(max(s))   # 30
print(sorted(s))    # [10, 20, 30]


# 집합 합치기
s2 = {40, 50}
# print(s + s2)   # TypeError
print(s.union(s2))  # union: 새로운 셋을 만듬 <-> update: 원본 변경

# 집합 반복하기
# print(s * 2)    # TypeError

# 멤버십 연산자
print(10 in s)
print(1 in s)